---
kind: property
id: P:Autodesk.Revit.DB.Visual.SolidGlass.SolidglassBumpAmount
source: html/32ee4374-a275-8963-e29a-2a2a4e98cfff.htm
---
# Autodesk.Revit.DB.Visual.SolidGlass.SolidglassBumpAmount Property

The property labeled "Amount" from the "SolidGlass" schema.

## Syntax (C#)
```csharp
public static string SolidglassBumpAmount { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 2".